/*



*/

//おはよう世界
//

/*
Githubの使い方
	導入編
		http://codezine.jp/article/detail/8436?p=3
		↑参考サイト

		VisualBasic2013で「チームエクスプローラ」を表示する．
		（↑ソリューションエクスプローラとかのとこ）

		「チームエクスプローラ」の中の「接続」のタブを開く

		「ローカルGitリポジトリ」の「複製▼」で黄色いところに↓
		https://github.com/HORIOJAPAN/GithubTeamTest.git
		をコピーする

		「複製」する


	編集（コミット）編
		「ソリューションエクスプローラ」から
		GithubTeamTest/GithubTest/Source.cpp
		↑を開く

		何かコメントアウトした状態で追記してみる

		ここまではローカルでの編集

		サーバにアップロードする場合は「コミット」して「同期」する必要がある

		「チームエクスプローラ」の「変更」タブを開く

		＜コミットメッセージを入力してください＞の欄に文字を入力
		（↑あいｌｇｖなうえｒｇｖじおｊ）





*/
