/*



*/

//おはよう世界
//	編集できました。。。
//test
//

/*
Githubの使い方

	http://codezine.jp/article/detail/8436?p=3
	↑参考サイト




	最初に

	VisualBasic2013で「チームエクスプローラ」を表示する．
	（↑ソリューションエクスプローラとかのとこ）
		（↑ない場合はファイルとかの列の「表示（V)」（Alt+[V]）から開ける）




	ログイン編

		「チームエクスプローラ」の「設定」から「Git」「Git設定」

		から「グローバル設定」にてGithubで登録したユーザ名・アドレスを入力

		「更新」




	導入編

		「チームエクスプローラ」の中の「接続」のタブを開く

		「ローカルGitリポジトリ」の「複製▼」で黄色いところに↓
		https://github.com/HORIOJAPAN/GithubTeamTest.git
		↑をコピーする

		「複製」する



	編集（コミット）編

		「ソリューションエクスプローラ」から↓
		GithubTeamTest/GithubTest/Source.cpp
		↑を開く

		何かコメントアウトした状態で追記してみる

		ここまではローカルでの編集

		サーバにアップロードする場合は「コミット」して「同期」する必要がある

		「チームエクスプローラ」の「ホーム」から「変更」タブを開く

		＜コミットメッセージを入力してください＞の欄に文字を入力
		（↑あいｌｇｖなうえｒｇｖじおｊ）（改行できるよ）

		「コミット」→「同期」
		（コミットボタンの右の「▼」で「コミットして同期」だと一発！）
		（↑「コミットしてプッシュ」でもいいが，それだとプルできないと思う）

		コミットできてるか不安ならウェブブラウザで確認↓
		https://github.com/HORIOJAPAN




	ブラウザのソースコード画面の使い方
		
		コードを開いた上で
		
		「Raw」でテキストデータ状態のコードを表示できる

		「Blame」で部分ごとに編集したアカウントを見られる（責任の所在）

		「History」で編集履歴が見られる
		コミットコメントと編集アカウント，経過時間など
		右の＜＞マークでその時点でのコードが閲覧できる



*/
